<script>
	let numw = -1;
	let numr = -1;
	let weapon = [
		"わかばシューター",
		"もみじシューター",
		"スプラシューター",
		"スプラシューターコラボ",
		"プロモデラーMG(銀モデラー)",
		"プロモデラーRG(金モデラー)",
		"N-ZAP85(黒ZAP)",
		"N-ZAP89(赤ZAP)",
		"スペースシューター",
		"プライムシューター",
		"プライムシューターコラボ",
		"ボールドマーカー",
		"ボールドマーカーネオ",
		".52ガロン",
		"L3リールガン",
		"L3リールガンD",
		"ジェットスイーパー",
		"ジェットスイーパーカスタム",
		"シャープマーカー",
		"シャープマーカーネオ",
		".96ガロン",
		".96ガロンデコ",
		"ボトルガイザー",
		"H3リールガン",
		"スプラチャージャー",
		"スプラチャージャーコラボ",
		"スクイックリンα",
		"スプラスコープ",
		"スプラスコープコラボ",
		"R-PEN/5H",
		"リッター4K",
		"14式竹筒銃・甲",
		"ソイチューバー",
		"4Kスコープ",
		"ホットブラスター",
		"ラピッドブラスター",
		"ラピッドブラスターデコ",
		"ロングブラスター",
		"ノヴァブラスター",
		"ノヴァブラスターネオ",
		"クラッシュブラスター",
		"クラッシュブラスターネオ",
		"Rブラスターエリート",
		"スプラローラー",
		"スプラローラーコラボ",
		"カーボンローラー",
		"カーボンローラーデコ",
		"ダイナモローラー",
		"ワイドローラー",
		"ヴァリアブルローラー",
		"ホクサイ",
		"パブロ",
		"パブロ・ヒュー",
		"バケットスロッシャー",
		"バケットスロッシャーデコ",
		"ヒッセン",
		"ヒッセン・ヒュー",
		"スクリュースロッシャー",
		"オーバーフロッシャー",
		"エクスプロッシャー",
		"バレルスピナー",
		"スプラスピナー",
		"スプラスピナーコラボ",
		"ハイドラント",
		"ノーチラス47",
		"クーゲルシュライバー",
		"スプラマニューバー",
		"デュアルスイーパー",
		"スパッタリー",
		"スパッタリー・ヒュー",
		"クアッドホッパーブラック",
		"ケルビン525",
		"パラシェルター",
		"キャンピングシェルター",
		"スパイガジェット",
		"ドライブワイパー",
		"ジムワイパー",
		"トライストリンガー",
		"LACT-450",
		"所持ブキ一覧で表示形式を『よく使う』にしたときに、最後にくるブキ",
		"直近の試合でキル数(アシスト含む)が最も多かったプレイヤーが使用していたブキ",
		"直近の試合で塗りポイントが最も高かったプレイヤーが使用していたブキ",
		"直近の試合でデス数が最も少なかったプレイヤーが使用していたブキ",
		"今現在のサーモンランの編成にある4つのブキのうちのいずれか"
	];

	let rule = [
		"ナワバリバトル",
		"ナワバリバトル",
		"ナワバリバトル",
		"ナワバリバトル",
		"ガチエリア",
		"ガチエリア",
		"ガチヤグラ",
		"ガチヤグラ",
		"ガチホコバトル",
		"ガチホコバトル",
		"ガチアサリ",
		"ガチアサリ",
		"今現在、バンカラマッチのオープンで行われているルール",
		"今現在、バンカラマッチのチャレンジで行われているルール",
	];

	let WMAX = weapon.length-1;
	let RMAX = rule.length-1;
	let seed = 0;
	let printseed = 0;

	function makeSeedRandom(){
		let flg = false;
		if((seed===0)||(seed===null)){
			seed = Math.floor(Math.random()*1000000);
			
			flg = true;
		}
		printseed = seed;

		let x = 123456789;
		let y = 362436069;
		let z = 521288629;
		let t = x^(x<<11);
		let r = Math.abs((seed^(seed>>>19))^(t^(t>>>8)));
		numw = r%(WMAX+1);

		x = 123456788;
		y = 362436069;
		z = 521288629;
		t = x^(x<<11);
		r = Math.abs((seed^(seed>>>19))^(t^(t>>>8)));
		numr = r%(RMAX+1);

		if(flg){
			seed = 0;
		}
	}

</script>

<main>
	{#if numw===-1}
		<p>ボタンを押してください</p><br>
	{:else}
		<p>あなたは<br>「<strong>{weapon[numw]}</strong>」で<br>「<strong>{rule[numr]}</strong>」に参加してください。</p>
		<!-- <p><span style="font-size:4vmin;">シード値:{printseed}</span></p> -->
	{/if}
	<div class="centering">
		<!-- <p>シード値指定 : <input type="number" min="0" max="999999" bind:value={seed} placeholder="シード値"></p> -->
		<button on:click={makeSeedRandom}>Push</button>
	</div>
</main>

<style>
	p {
		text-align:center;
		font-size:5vmin;
	}

	.centering{
		text-align:center;
	}

	button {
		border: 2px solid black;
		color: salmon;
  		border-radius: 0;
  		background: #fff;
		margin:auto;
		font-size:5vmin;
	}

	button:hover {
  		color: #fff;
  		background: salmon;
		margin:auto
	}
</style>